#include <stdio.h>
int main()
{
	int tab[2][13] = { {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
	   {0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31} };
	int y0, m0, d0, i, dd, dl;
	scanf ("%d %d %d %d", &y0, &m0, &d0, &dd);
	int j = y0 % 400 == 0 || y0 % 4 == 0 && y0 % 100 != 0;
	
	for (i = 0; i < m0; i++)
		d0 = d0 + tab[j][i];	//当前是第几天 
	dl = d0 + dd;	//要求的是这一年的第几天 
	
	i = 1;	  //从一月开始减 
	while (dl > tab[j][i]) 
	{ 
		dl = dl - tab[j][i];
		i++; 
		if (i > 12)
		{
			i = i - 12;
			j = (y0 + 1) % 400 == 0 || (y0 + 1) % 4 == 0 && (y0 + 1) % 100 != 0;
			y0 = y0 + 1;
		}
	} 
	printf ("%d.%d.%d\n", y0, i, dl);

		
	
}