#include <stdio.h>
#include <stdlib.h>

/* 

给你一个集合{0,1,2...n-1}

请设计一个程序求出其所有非空子集，并按一定顺序输出


输入

一个整数n (n <= 18)


输出

2^n-1行，每一行为一个真子集，每个数之间用空格分隔开

测试输入关于“测试输入”的帮助

期待的输出关于“期待的输出”的帮助

时间限制关于“时间限制”的帮助

内存限制关于“内存限制”的帮助

额外进程关于“{$a} 个额外进程”的帮助


测试用例 1 以文本方式显示
1.1?
 以文本方式显示
1.0 ?
 2秒 64M 0 
测试用例 2 以文本方式显示
1.2?
 以文本方式显示
1.0 ?
2.1 ?
3.0 1 ?
 2秒 64M 0 
测试用例 3 以文本方式显示
1.3?
 以文本方式显示
1.0 ?
2.1 ?
3.0 1 ?
4.2 ?
5.0 2 ?
6.1 2 ?
7.0 1 2 ?
 2秒 64M 0 
测试用例 4 以文本方式显示
1.4?
 以文本方式显示
1.0 ?
2.1 ?
3.0 1 ?
4.2 ?
5.0 2 ?
6.1 2 ?
7.0 1 2 ?
8.3 ?
9.0 3 ?
10.1 3 ?
11.0 1 3 ?
12.2 3 ?
13.0 2 3 ?
14.1 2 3 ?
15.0 1 2 3 ?
 2秒 
*/

int main(int argc, char *argv[]) {
	return 0;
}
